DriveMani/DriverInput-MCU/ts_mirr/xml/eb-tresos-MPC560XB_MCAL4_0_RTM_1_0_1_HF13/plugins/Adc_TS_T2D13M10I1R0/generate_PC/src/Adc_Cfg.c
[!CODE!][!//
/**
*   @file    Adc_Cfg.c
*   @version 1.0.1
*
*   @brief   AUTOSAR Adc - Pre-Compile configurations for ADC driver.
*   @details Pre-Compile configuration file for ADC driver.
*
*   @addtogroup ADC
*   @{
*/
/*==================================================================================================
*   Project              : AUTOSAR 4.0 MCAL
*   Platform             : PA
*   Peripheral           : ADCDIG
*   Dependencies         : none
*
*   Autosar Version      : 4.0.3
*   Autosar Revision     : ASR_REL_4_0_REV_0003
*   Autosar Conf.Variant :
*   SW Version           : 1.0.1
*   Build Version        : MPC560xB_MCAL_1_0_1_RTM_ASR_REL_4_0_REV_0003_20140606
*
*   (c) Copyright 2006-2014 Freescale Semiconductor Inc and STMicroelectronics
*   All Rights Reserved.
==================================================================================================*/
/*==================================================================================================
==================================================================================================*/

#ifdef __cplusplus
extern "C"{
#endif

/**
* @page misra_violations MISRA-C:2004 violations
*
* @section Adc_Cfg_c_REF_1
* Violates MISRA 2004 Advisory Rule 19.1, only preprocessor statements and comments before "#include"
* This violation is not fixed since the inclusion of MemMap.h is as per Autosar requirement.
*
* @section Adc_Cfg_c_REF_2
* Violates MISRA 2004 Required Rule 19.15, Repeated include file
* This comes from the order of includes in the .c file and from include dependencies. As a safe
* approach, any file must include all its dependencies. Header files are already protected against
* double inclusions.
*
* @section Adc_Cfg_c_REF_3
* Violates MISRA 2004 Required Rule 5.1, Identifiers shall not more than 31 characters
* Violation is needed because of Autosar restrictions for naming File version check macros.
* 
*/

/*==================================================================================================
*                                        INCLUDE FILES
* 1) system and project includes
* 2) needed interfaces from external units
* 3) internal and external interfaces from this unit
==================================================================================================*/
/* @implements     DADC00008 */
#include "Adc.h"
#include "Reg_eSys_ADCDig.h"

#ifdef ADC_PRECOMPILE_SUPPORT

[!NOCODE!][!//
[!INCLUDE "Adc_VersionCheck_Src.m"!][!//
[!ENDNOCODE!][!//

[!NOCODE!][!//
[!INCLUDE "Adc_RegOperations.m"!][!//
[!ENDNOCODE!][!//

/*==================================================================================================
*                              SOURCE FILE VERSION INFORMATION
==================================================================================================*/
/**
* @file           Adc_Cfg.c
* @implements     DADC04070
*/
#define ADC_CFG_C_VENDOR_ID                    (43)
/* @violates @ref Adc_Cfg_c_REF_3 Identifier exceeds 31 characters */
#define ADC_CFG_C_AR_RELEASE_MAJOR_VERSION     (4)
/* @violates @ref Adc_Cfg_c_REF_3 Identifier exceeds 31 characters */
#define ADC_CFG_C_AR_ERLEASE_MINOR_VERSION     (0)
/* @violates @ref Adc_Cfg_c_REF_3 Identifier exceeds 31 characters */
#define ADC_CFG_C_AR_RELEASE_REVISION_VERSION  (3)
#define ADC_CFG_C_SW_MAJOR_VERSION             (1)
#define ADC_CFG_C_SW_MINOR_VERSION             (0)
#define ADC_CFG_C_SW_PATCH_VERSION             (1)

/*==================================================================================================
*                                     FILE VERSION CHECKS
==================================================================================================*/
/* @implements     DADC06008 */
/* Check if source file and ADC header file are of the same vendor */
#if (ADC_CFG_C_VENDOR_ID != ADC_VENDOR_ID)
    #error "Adc_Cfg.c and Adc.h have different vendor ids"
#endif

/* Check if source file and ADC header file are of the same Autosar version */
#if ((ADC_CFG_C_AR_RELEASE_MAJOR_VERSION != ADC_AR_RELEASE_MAJOR_VERSION) || \
     (ADC_CFG_C_AR_ERLEASE_MINOR_VERSION != ADC_AR_RELEASE_MINOR_VERSION) || \
     (ADC_CFG_C_AR_RELEASE_REVISION_VERSION != ADC_AR_RELEASE_REVISION_VERSION))
    #error "AutoSar Version Numbers of Adc_Cfg.c and Adc.h are different"
#endif

/* Check if source file and ADC header file are of the same Software version */
#if ((ADC_CFG_C_SW_MAJOR_VERSION != ADC_SW_MAJOR_VERSION) || \
     (ADC_CFG_C_SW_MINOR_VERSION != ADC_SW_MINOR_VERSION) || \
     (ADC_CFG_C_SW_PATCH_VERSION != ADC_SW_PATCH_VERSION))
    #error "Software Version Numbers of Adc_Cfg.c and Adc.h are different"
#endif

/* Check if source file and Reg_eSys_ADCDig header file are of the same vendor */
#if (ADC_CFG_C_VENDOR_ID != ADC_REG_VENDOR_ID)
    #error "Adc_Cfg.c and Reg_eSys_ADCDig.h have different vendor ids"
#endif

/* Check if source file and Reg_eSys_ADCDig header file are of the same Autosar version */
#if ((ADC_CFG_C_AR_RELEASE_MAJOR_VERSION != ADC_REG_AR_RELEASE_MAJOR_VERSION) || \
     (ADC_CFG_C_AR_ERLEASE_MINOR_VERSION != ADC_REG_AR_RELEASE_MINOR_VERSION) || \
     (ADC_CFG_C_AR_RELEASE_REVISION_VERSION != ADC_REG_AR_RELEASE_REVISION_VERSION))
    #error "AutoSar Version Numbers of Adc_Cfg.c and Reg_eSys_ADCDig.h are different"
#endif

/* Check if source file and Reg_eSys_ADCDig header file are of the same Software version */
#if ((ADC_CFG_C_SW_MAJOR_VERSION != ADC_REG_SW_MAJOR_VERSION) || \
     (ADC_CFG_C_SW_MINOR_VERSION != ADC_REG_SW_MINOR_VERSION) || \
     (ADC_CFG_C_SW_PATCH_VERSION != ADC_REG_SW_PATCH_VERSION))
    #error "Software Version Numbers of Adc_Cfg.c and Reg_eSys_ADCDig.h are different"
#endif

/*==================================================================================================
*                          LOCAL TYPEDEFS (STRUCTURES, UNIONS, ENUMS)
==================================================================================================*/

/*==================================================================================================
*                                       GLOBAL FUNCTIONS
==================================================================================================*/
#define ADC_START_SEC_CODE
/* @violates @ref Adc_Cfg_c_REF_1 only preprocessor statements and comments before "#include" */
/* @violates @ref Adc_Cfg_c_REF_2 Repeated include file */
#include "MemMap.h"

[!NOCODE!][!//
[!VAR "BOLERO256K" = "0"!][!//
[!SELECT "as:modconf('Resource')[1]"!][!//
[!IF "(ResourceGeneral/ResourceSubderivative = 'mpc5601dxlh_lqfp64') or [!//
      (ResourceGeneral/ResourceSubderivative = 'mpc5601dxll_lqfp100') or [!//
      (ResourceGeneral/ResourceSubderivative = 'mpc5602dxlh_lqfp64') or [!//
      (ResourceGeneral/ResourceSubderivative = 'mpc5602dxll_lqfp100') or [!//
      (ResourceGeneral/ResourceSubderivative = 'spc560d30xlh_lqfp64') or [!//
      (ResourceGeneral/ResourceSubderivative = 'spc560d30xll_lqfp100') or [!//
      (ResourceGeneral/ResourceSubderivative = 'spc560d40xlh_lqfp64') or [!//
      (ResourceGeneral/ResourceSubderivative = 'spc560d40xll_lqfp100')"!][!//
    [!VAR "BOLERO256K" = "1"!][!//
[!ENDIF!][!//
[!ENDSELECT!][!//
[!ENDNOCODE!][!//

/**
* @brief          ADC Notification functions.
* @details        ADC Nofification functions defined inside the Plugin.
*
* @implements     DADC04071
*/
[!LOOP "AdcConfigSet/*[1]/AdcHwUnit/*/AdcGroup/*"!][!//
[!IF "../../../../../../AdcGeneral/AdcGrpNotifCapability = 'true'"!][!//
[!IF "AdcNotification != 'NULL_PTR'"!][!//
/* @violates @ref Adc_Cfg_c_REF_3 Identifier exceeds 31 characters */
extern void [!"AdcNotification"!](void); /**< @brief for Group - [!"./AdcGroupId"!] */
[!ENDIF!][!//
[!ENDIF!][!//
[!ENDLOOP!][!//

/**
* @brief          Adc Watchdog notification functions.
* @details        Adc Watchdog notification functions defined inside the Plugin.
*
* @implements     DADC04072 
*/
[!LOOP "AdcConfigSet/*[1]/AdcHwUnit/*/AdcChannel/*/AdcThresholdControl"!][!//
[!IF "AdcEnableThresholds = 'true'"!][!//
[!IF "AdcWdogNotification != 'NULL_PTR'"!][!//
extern void [!"AdcWdogNotification"!](void); /**< @brief for Channel - [!"../AdcChannelId"!] */
[!ENDIF!][!//
[!ENDIF!][!//
[!ENDLOOP!][!//

#define ADC_STOP_SEC_CODE
/* @violates @ref Adc_Cfg_c_REF_1 only preprocessor statements and comments before "#include" */
/* @violates @ref Adc_Cfg_c_REF_2 Repeated include file */
#include "MemMap.h"

/*==================================================================================================
*                                      GLOBAL VARIABLES
==================================================================================================*/

/*==================================================================================================
*                                       LOCAL MACROS
==================================================================================================*/
/**
* @brief          Total number of groups in Config0.
*
* @implements     DADC04073  
*/
#define ADC_GROUPS           ([!"num:i(count(AdcConfigSet/*[1]/AdcHwUnit/*/AdcGroup/*))"!])

/*==================================================================================================
*                                      LOCAL VARIABLES
==================================================================================================*/
/* @violates @ref Adc_Cfg_c_REF_3 Identifier exceeds 31 characters */
#define ADC_START_SEC_VAR_INIT_UNSPECIFIED
/* @violates @ref Adc_Cfg_c_REF_1 only preprocessor statements and comments before "#include" */
/* @violates @ref Adc_Cfg_c_REF_2 Repeated include file */
#include "MemMap.h"

/**
* @brief          Adc Result Buffer RAM initializations.
* @details        Array for all ADC group result ram buffers.
*
* @implements     DADC04074
*/
STATIC P2VAR(Adc_ValueGroupType, ADC_VAR, ADC_APPL_DATA) ADC_ResultsBufferPtr[] =
{
[!VAR "MAX_NUM"="count(AdcConfigSet/*[1]/AdcHwUnit/*/AdcGroup/*)"!][!//
[!VAR "CRT_NUM"="1"!][!//
[!LOOP "AdcConfigSet/*[1]/AdcHwUnit/*/AdcGroup/*"!][!//
 NULL_PTR[!IF "$CRT_NUM<$MAX_NUM"!],[!ELSE!][!ENDIF!]
[!VAR "CRT_NUM"="$CRT_NUM+1"!][!//
[!ENDLOOP!][!//
};

/* @violates @ref Adc_Cfg_c_REF_3 Identifier exceeds 31 characters */
#define ADC_STOP_SEC_VAR_INIT_UNSPECIFIED
/* @violates @ref Adc_Cfg_c_REF_1 only preprocessor statements and comments before "#include" */
/* @violates @ref Adc_Cfg_c_REF_2 Repeated include file */
#include "MemMap.h"

/*==================================================================================================
*                                      LOCAL CONSTANTS
==================================================================================================*/
/* @violates @ref Adc_Cfg_c_REF_3 Identifier exceeds 31 characters */
#define ADC_START_SEC_CONFIG_DATA_UNSPECIFIED
/* @violates @ref Adc_Cfg_c_REF_1 only preprocessor statements and comments before "#include" */
/* @violates @ref Adc_Cfg_c_REF_2 Repeated include file */
#include "MemMap.h"

/**
* @brief          Hardware trigger sources configured for group.
*
* @implements    DADC04075
*/
[!LOOP "AdcConfigSet/*[1]/AdcHwUnit/*/AdcGroup/*"!][!//
[!IF "AdcGroupTriggSrc = 'ADC_TRIGG_SRC_HW'"!][!//
[!VAR "HWNUM" ="num:i(count(AdcHwTrig/*))"!][!//
STATIC CONST(Adc_HwTriggerTimerType, ADC_CONST) Adc_GroupTriggerSource[!"AdcGroupId"!]_PC[[!"num:i(count(AdcHwTrig/*))"!]] =
{
[!VAR "INTINDEX" = "0"!][!//
[!LOOP "AdcHwTrig/*"!][!//
[!VAR "HWRES"!][!CALL "HWRESOURCE" , "SOURCE" = "AdcHwTrigSrc"!][!ENDVAR!][!//
 (Adc_HwTriggerTimerType)[!"num:i(number($HWRES))"!][!//
[!IF "$INTINDEX < ($HWNUM - 1)"!],[!ENDIF!][!VAR "INTINDEX"="$INTINDEX + 1"!]
[!ENDLOOP!][!//
};
[!ENDIF!][!//
[!ENDLOOP!][!//

/**
* @brief          Group Assignments on ADC Hardware unit 0.
*
* @implements     DADC04076
*/
[!LOOP "AdcConfigSet/*[1]/AdcHwUnit/*/AdcGroup/*"!][!//
[!IF "../../AdcHwUnitId = 'ADC_UNIT_0'"!][!//
STATIC CONST(Adc_ChannelType, ADC_CONST) ADC_Group[!"AdcGroupId"!]_Assignment_PC_0[ADC_CFGSET1_GROUP_[!"AdcGroupId"!]_CHANNELS] =
{
[!VAR "MAX_COUNT" = "count(AdcGroupDefinition/*)-1"!][!//
[!VAR "CRT_COUNT" = "0"!][!//
[!LOOP "AdcGroupDefinition/*"!][!//
[!VAR "CurrAdcChannel" = "."!][!//
[!VAR "CurrAdcChannel1" = "substring-after(substring-after(substring-after(substring-after(substring-after($CurrAdcChannel,'/'),'/'),'/'),'/'),'/')"!][!//
[!VAR "INDEX" = "0"!][!//
[!LOOP "../../../../AdcChannel/*"!][!//
[!IF "@name = $CurrAdcChannel1"!][!//
 [!"AdcChannelId"!]U[!IF "$CRT_COUNT < $MAX_COUNT"!],[!ELSE!][!ENDIF!]
[!ENDIF!][!//
[!VAR "INDEX" = "$INDEX + 1"!][!//
[!ENDLOOP!][!//
[!VAR "CRT_COUNT" = "$CRT_COUNT + 1"!][!//
[!ENDLOOP!][!//
};
[!ENDIF!][!//
[!ENDLOOP!][!//

/**
* @brief          Group Assignments on ADC Hardware unit 1.
*
* @implements     DADC04077
*/
[!LOOP "AdcConfigSet/*[1]/AdcHwUnit/*/AdcGroup/*"!][!//
[!IF "../../AdcHwUnitId = 'ADC_UNIT_1'"!][!//
STATIC CONST(Adc_ChannelType, ADC_CONST) ADC_Group[!"AdcGroupId"!]_Assignment_PC_1[ADC_CFGSET1_GROUP_[!"AdcGroupId"!]_CHANNELS] =
{
[!VAR "MAX_COUNT" = "count(AdcGroupDefinition/*)-1"!][!//
[!VAR "CRT_COUNT" = "0"!][!//
[!LOOP "AdcGroupDefinition/*"!][!//
[!VAR "CurrAdcChannel" = "."!][!//
[!VAR "CurrAdcChannel1" = "substring-after(substring-after(substring-after(substring-after(substring-after($CurrAdcChannel,'/'),'/'),'/'),'/'),'/')"!][!//
[!VAR "INDEX" = "0"!][!//
[!LOOP "../../../../AdcChannel/*"!][!//
[!IF "@name = $CurrAdcChannel1"!][!//
 [!"AdcChannelId"!]U[!IF "$CRT_COUNT<$MAX_COUNT"!],[!ELSE!][!ENDIF!]
[!ENDIF!][!//
[!VAR "INDEX" = "$INDEX + 1"!][!//
[!ENDLOOP!][!//
[!VAR "CRT_COUNT" = "$CRT_COUNT + 1"!][!//
[!ENDLOOP!][!//
};
[!ENDIF!][!//
[!ENDLOOP!][!//

[!NOCODE!][!//
/**
* @brief          Definition of Precise PSR and Wdg Enable CWENR for HWUnit_0
*/
[!VAR "AdcPrecisePsr_Hw0"="0"!][!//
[!VAR "AdcExtdPsr_Hw0"="0"!][!//
[!VAR "AdcExternalPsr_Hw0"="0"!][!//
[!VAR "AdcWer0_Hw0"="0"!][!//
[!VAR "AdcWer1_Hw0"="0"!][!//
[!VAR "AdcWer2_Hw0"="0"!][!//
[!VAR "CurrAdcChannel" = "0"!][!//
[!VAR "CurrAdcChannel1" = "0"!][!//
[!VAR "AdcTemp_Ch" = "0"!][!//
[!LOOP "AdcConfigSet/*[1]/AdcHwUnit/*[AdcHwUnitId='ADC_UNIT_0']/AdcGroup/*"!][!//
[!LOOP "AdcGroupDefinition/*"!][!//
    [!VAR "CurrAdcChannel" = "."!][!//
    [!VAR "CurrAdcChannel1" = "substring-after(substring-after(substring-after(substring-after(substring-after($CurrAdcChannel,'/'),'/'),'/'),'/'),'/')"!]
[!LOOP "../../../../AdcChannel/*"!][!//
[!IF "$CurrAdcChannel1 = @name"!][!//
    [!IF "contains(AdcHwChannel,'ANP_')"!][!//
        [!VAR "AdcTemp_Ch" = "substring-after(AdcHwChannel,'ANP_')"!][!//
        [!VAR "AdcTemp_Ch" = "bit:shl(1,$AdcTemp_Ch)"!][!//
        [!IF "AdcEnablePresampling"!][!//
            [!VAR "AdcPrecisePsr_Hw0" = "bit:or($AdcPrecisePsr_Hw0,$AdcTemp_Ch)"!][!//
        [!ENDIF!][!//
        [!SELECT "AdcThresholdControl"!][!//
          [!IF "AdcEnableThresholds"!][!//
            [!VAR "AdcWer0_Hw0" = "bit:or($AdcWer0_Hw0,$AdcTemp_Ch)"!][!//
          [!ENDIF!][!//
        [!ENDSELECT!][!//
    [!ELSEIF "contains(AdcHwChannel,'ANS_')"!][!//
        [!VAR "AdcTemp_Ch" = "substring-after(AdcHwChannel,'ANS_')"!][!//
        [!VAR "AdcTemp_Ch" = "bit:shl(1,$AdcTemp_Ch)"!][!//
        [!IF "AdcEnablePresampling"!][!//
            [!VAR "AdcExtdPsr_Hw0" = "bit:or($AdcExtdPsr_Hw0,$AdcTemp_Ch)"!][!//
        [!ENDIF!][!//
        [!SELECT "AdcThresholdControl"!][!//
          [!IF "AdcEnableThresholds"!][!//
            [!VAR "AdcWer1_Hw0" = "bit:or($AdcWer1_Hw0,$AdcTemp_Ch)"!][!//
          [!ENDIF!][!//
        [!ENDSELECT!][!//
    [!ELSEIF "contains(AdcHwChannel,'ANX_')"!][!//
        [!VAR "AdcTemp_Ch" = "num:i(substring-after(AdcHwChannel,'CH_') - 64)"!][!//
        [!VAR "AdcTemp_Ch" = "bit:shl(1,$AdcTemp_Ch)"!][!//
        [!IF "AdcEnablePresampling"!][!//
            [!VAR "AdcExternalPsr_Hw0" = "bit:or($AdcExternalPsr_Hw0,$AdcTemp_Ch)"!][!//
        [!ENDIF!][!//
        [!SELECT "AdcThresholdControl"!][!//
          [!IF "AdcEnableThresholds"!][!//
            [!VAR "AdcWer2_Hw0" = "bit:or($AdcWer2_Hw0,$AdcTemp_Ch)"!][!//
          [!ENDIF!][!//
        [!ENDSELECT!][!//
    [!ENDIF!][!//
[!ENDIF!][!//
[!ENDLOOP!][!//
[!ENDLOOP!][!//
[!ENDLOOP!][!//
[!ENDNOCODE!][!//

[!NOCODE!][!//
/**
* @brief          Definition of Precise PSR and Wdg Enable CWENR for HWUnit_1
*/
[!VAR "AdcPrecisePsr_Hw1"="0"!][!//
[!VAR "AdcExtdPsr_Hw1"="0"!][!//
[!VAR "AdcExternalPsr_Hw1"="0"!][!//
[!VAR "AdcWer0_Hw1"="0"!][!//
[!VAR "AdcWer1_Hw1"="0"!][!//
[!VAR "AdcWer2_Hw1"="0"!][!//
[!VAR "CurrAdcChannel" = "0"!][!//
[!VAR "CurrAdcChannel1" = "0"!][!//
[!VAR "AdcTemp_Ch" = "0"!][!//
[!LOOP "AdcConfigSet/*[1]/AdcHwUnit/*[AdcHwUnitId='ADC_UNIT_1']/AdcGroup/*"!][!//
[!LOOP "AdcGroupDefinition/*"!][!//
    [!VAR "CurrAdcChannel" = "."!][!//
    [!VAR "CurrAdcChannel1" = "substring-after(substring-after(substring-after(substring-after(substring-after($CurrAdcChannel,'/'),'/'),'/'),'/'),'/')"!]
[!LOOP "../../../../AdcChannel/*"!][!//
[!IF "$CurrAdcChannel1 = @name"!][!//
    [!IF "contains(AdcHwChannel,'ANP_')"!][!//
        [!VAR "AdcTemp_Ch" = "substring-after(AdcHwChannel,'ANP_')"!][!//
        [!VAR "AdcTemp_Ch" = "bit:shl(1,$AdcTemp_Ch)"!][!//
        [!IF "AdcEnablePresampling"!][!//
            [!VAR "AdcPrecisePsr_Hw1" = "bit:or($AdcPrecisePsr_Hw1,$AdcTemp_Ch)"!][!//
        [!ENDIF!][!//
        [!SELECT "AdcThresholdControl"!][!//
          [!IF "AdcEnableThresholds"!][!//
            [!VAR "AdcWer0_Hw1" = "bit:or($AdcWer0_Hw1,$AdcTemp_Ch)"!][!//
          [!ENDIF!][!//
        [!ENDSELECT!][!//
    [!ELSEIF "contains(AdcHwChannel,'ANS_')"!][!//
        [!VAR "AdcTemp_Ch" = "substring-after(AdcHwChannel,'ANS_')"!][!//
        [!VAR "AdcTemp_Ch" = "bit:shl(1,$AdcTemp_Ch)"!][!//
        [!IF "AdcEnablePresampling"!][!//
            [!VAR "AdcExtdPsr_Hw1" = "bit:or($AdcExtdPsr_Hw1,$AdcTemp_Ch)"!][!//
        [!ENDIF!][!//
        [!SELECT "AdcThresholdControl"!][!//
          [!IF "AdcEnableThresholds"!][!//
            [!VAR "AdcWer1_Hw1" = "bit:or($AdcWer1_Hw1,$AdcTemp_Ch)"!][!//
          [!ENDIF!][!//
        [!ENDSELECT!][!//
    [!ELSEIF "contains(AdcHwChannel,'ANX_')"!][!//
        [!VAR "AdcTemp_Ch" = "num:i(substring-after(AdcHwChannel,'CH_') - 64)"!][!//
        [!VAR "AdcTemp_Ch" = "bit:shl(1,$AdcTemp_Ch)"!][!//
        [!IF "AdcEnablePresampling"!][!//
            [!VAR "AdcExternalPsr_Hw1" = "bit:or($AdcExternalPsr_Hw1,$AdcTemp_Ch)"!][!//
        [!ENDIF!][!//
        [!SELECT "AdcThresholdControl"!][!//
          [!IF "AdcEnableThresholds"!][!//
            [!VAR "AdcWer2_Hw1" = "bit:or($AdcWer2_Hw1,$AdcTemp_Ch)"!][!//
          [!ENDIF!][!//
        [!ENDSELECT!][!//
    [!ENDIF!][!//
[!ENDIF!][!//
[!ENDLOOP!][!//
[!ENDLOOP!][!//
[!ENDLOOP!][!//
[!ENDNOCODE!][!//

