DriveMani/DriverInput-MCU/ts_mirr/xml/eb-tresos-MPC560XB_MCAL4_0_RTM_1_0_1_HF13/plugins/Adc_TS_T2D13M10I1R0/generate_PC/src/Adc_Cfg.c
/**
* @brief          Definition of ADC Hardware units.
*
* @implements     DADC04078
*/
STATIC CONST(Adc_LLD_HWUnitConfiguration, ADC_CONST) Adc_HWUnit_CfgPC[] =
{
[!VAR "MAX_COUNT"="count(AdcConfigSet/*[1]/AdcHwUnit/*) - 1"!][!//
[!VAR "CRT_COUNT"="0"!][!//
[!LOOP "AdcConfigSet/*[1]/AdcHwUnit/*"!][!//
[!CODE!][!//
  /**< @brief Hardware Unit [!"AdcHwUnitId"!] */
  {
    /**< @brief Hardware unit id */
    (Adc_HwUnitType)[!"AdcHwUnitId"!],
    /**< @brief Main configuration for control register */
    (ADC_CLOCK_PRESCALER_DIV2 | [!IF "AdcAutoClockOff = 'true'"!]ADC_AUTO_CLKOFF_EN[!ELSE!]ADC_AUTO_CLKOFF_DIS[!ENDIF!] | ADC_OVERWRITE_EN | [!IF "../../../../AdcGeneral/AdcResultAlignment = 'ADC_ALIGN_RIGHT'"!]ADC_WRITE_RIGHT_ALIGNED[!ELSE!]ADC_WRITE_LEFT_ALIGNED[!ENDIF!]),
    /**< @brief Power down exit delay when ADC runs on normal system frequency */
    (ADC_POWERDOWN_EXIT_DELAY_VALUE([!"num:i(AdcPowerDownDelay)"!])),
[!IF "(../../../../NonAutosar/AdcEnableDualClockMode)"!][!//
    /**< @brief Alternate Power down exit delay when ADC runs on low power system frequency */
    (ADC_POWERDOWN_EXIT_DELAY_VALUE([!"num:i(AdcAltPowerDownDelay)"!])),
[!ENDIF!][!//
    /**< @brief Mux delay value */
[!IF "(../../../../AdcGeneral/AdcMuxDelaySupport)"!][!//
    (MUX_DELAY_VALUE([!"num:i(AdcMuxDelay)"!])), /* Mux delay value */
[!ENDIF!][!//
[!IF "AdcPresamplingEnableSignal = 'ADC_PRESAMP_VOLTAGE_V1' "!][!//
    /**< @brief ADC_PRESAMP_VOLTAGE_V1 -> Vdd=5V */
    (uint8)0x1,
[!ELSE!][!//
    /**< @brief ADC_PRESAMP_VOLTAGE_V0 -> Vss=0V */
    (uint8)0x0,
[!ENDIF!][!//
[!IF "AdcBypassSampling = 'true'"!][!//
    /**< @brief Bypass the sampling phase */
    (uint8)0x1,
[!ELSE!][!//
    /**< @brief do not bypass the sampling phase */
    (uint8)0x0,
[!ENDIF!][!//
[!IF "(../../../../NonAutosar/AdcEnableDualClockMode)"!][!//
    (Adc_ConversionTimeType)(ADC_INPLATCH_VALUE([!"(AdcNormalAltConvTimings/AdcLatchingDurationNormal)"!])|ADC_INPCMP_VALUE([!"(AdcNormalAltConvTimings/AdcComparisonDurationNormal)"!])|ADC_INPSAMP_VALUE([!"num:i(AdcNormalAltConvTimings/AdcSamplingDurationNormal)"!])), /* Normal Conversion time */
    (Adc_ConversionTimeType)(ADC_INPLATCH_VALUE([!"(AdcNormalAltConvTimings/AdcLatchingDurationAlt)"!])|ADC_INPCMP_VALUE([!"(AdcNormalAltConvTimings/AdcComparisonDurationAlt)"!])|ADC_INPSAMP_VALUE([!"num:i(AdcNormalAltConvTimings/AdcSamplingDurationAlt)"!])), /* Alternate Conversion time */
[!ELSE!][!//
    (Adc_ConversionTimeType)0x0,
    (Adc_ConversionTimeType)0x0,
[!ENDIF!][!//
    /**< @brief Bit resolution */
[!IF "AdcHwUnitId = 'ADC_UNIT_1'"!][!//
    (Adc_ResolutionType)ADC_BITS_RESOLUTION_12[!//
[!ELSE!][!//
[!SELECT "as:modconf('Resource')[1]"!][!//
[!IF "(ResourceGeneral/ResourceSubderivative = 'mpc5601dxlh_lqfp64') or [!//
      (ResourceGeneral/ResourceSubderivative = 'mpc5601dxll_lqfp100') or [!//
      (ResourceGeneral/ResourceSubderivative = 'mpc5602dxlh_lqfp64') or [!//
      (ResourceGeneral/ResourceSubderivative = 'mpc5602dxll_lqfp100') or [!//
      (ResourceGeneral/ResourceSubderivative = 'spc560d30xlh_lqfp64') or [!//
      (ResourceGeneral/ResourceSubderivative = 'spc560d30xll_lqfp100') or [!//
      (ResourceGeneral/ResourceSubderivative = 'spc560d40xlh_lqfp64') or [!//
      (ResourceGeneral/ResourceSubderivative = 'spc560d40xll_lqfp100')"!][!//
    (Adc_ResolutionType)ADC_BITS_RESOLUTION_12[!//
[!ELSE!][!//
    (Adc_ResolutionType)ADC_BITS_RESOLUTION_10[!//
[!ENDIF!][!//
[!ENDSELECT!][!//
[!ENDIF!][!//
[!IF "(../../../../AdcGeneral/AdcPreSamplingOnce) = 'true'"!][!//
[!IF "AdcHwUnitId = 'ADC_UNIT_0'"!],
    /**< @brief Presampling for Precision channels */
    (uint32)[!"num:inttohex($AdcPrecisePsr_Hw0)"!]U,
    /**< @brief Presampling for Extended channels */
    (uint32)[!"num:inttohex($AdcExtdPsr_Hw0)"!]U,
    /**< @brief Presampling for External channels */
    (uint32)[!"num:inttohex($AdcExternalPsr_Hw0)"!]U[!//
[!ENDIF!][!//
[!IF "AdcHwUnitId = 'ADC_UNIT_1'"!],
    /**< @brief Presampling for Precision channels */
    (uint32)[!"num:inttohex($AdcPrecisePsr_Hw1)"!]U,
    /**< @brief Presampling for Extended channels */
    (uint32)[!"num:inttohex($AdcExtdPsr_Hw1)"!]U,
    /**< @brief Presampling for External channels */
    (uint32)[!"num:inttohex($AdcExternalPsr_Hw1)"!]U[!//
[!ENDIF!][!//
[!ENDIF!][!//
[!IF "(../../../../AdcGeneral/AdcWdgThresholdOnce) = 'true'"!][!//
[!IF "AdcHwUnitId = 'ADC_UNIT_0'"!],
    /**< @brief Wer0 for precision channels */
    (uint32)[!"num:inttohex($AdcWer0_Hw0)"!]U,
    /**< @brief Wer1 for extended(medi.accuracy channels) */
    (uint32)[!"num:inttohex($AdcWer1_Hw0)"!]U,
    /**< @brief Wer2 for external channels */
    (uint32)[!"num:inttohex($AdcWer2_Hw0)"!]U[!//
[!ENDIF!][!//
[!IF "AdcHwUnitId = 'ADC_UNIT_1'"!],
    /**< @brief Wer0 for precision channels */
    (uint32)[!"num:inttohex($AdcWer0_Hw1)"!]U,
    /**< @brief Wer1 for extended(medi.accuracy channels) */
    (uint32)[!"num:inttohex($AdcWer1_Hw1)"!]U,
    /**< @brief Wer2 for external channels */
    (uint32)[!"num:inttohex($AdcWer2_Hw1)"!]U[!//
[!ENDIF!][!//
[!ENDIF!][!//
[!NOCODE!][!//
    [!IF "(../../../../AdcGeneral/AdcConvTimeOnce) = 'true'"!][!//
        [!IF "node:exists(AdcGroup/*[@index=0]) = 'true'"!][!//
            [!VAR "AdcGrpLatchDuration" = "AdcGroup/*[@index=0]/AdcGroupConversionConfiguration/AdcLatchingDuration"!][!//
            [!VAR "AdcGrpComparisionDuration" = "AdcGroup/*[@index=0]/AdcGroupConversionConfiguration/AdcComparisonDuration"!][!//
            [!VAR "AdcGrpSamplingDuration" = "AdcGroup/*[@index=0]/AdcGroupConversionConfiguration/AdcSamplingDuration"!][!//
        [!ENDIF!][!//
    [!ENDIF!][!//
[!ENDNOCODE!][!//
[!IF "(../../../../AdcGeneral/AdcConvTimeOnce) = 'true'"!],
    /**< @brief Conversion time */
    (ADC_INPLATCH_VALUE([!"$AdcGrpLatchDuration"!])|ADC_INPCMP_VALUE([!"$AdcGrpComparisionDuration"!])|ADC_INPSAMP_VALUE([!"$AdcGrpSamplingDuration"!]))
[!ENDIF!]
  }[!IF "$CRT_COUNT<$MAX_COUNT"!],[!ELSE!][!ENDIF!]
[!VAR "CRT_COUNT"="$CRT_COUNT+1"!][!//
[!ENDCODE!][!//
[!ENDLOOP!][!//
};

[!VAR "ADC0_EXISTS" = "0"!][!//
[!VAR "ADC1_EXISTS" = "0"!][!//
[!LOOP "AdcConfigSet/*[1]/AdcHwUnit/*"!][!//
[!IF "AdcHwUnitId = 'ADC_UNIT_0'"!][!//
[!VAR "ADC0_EXISTS" = "1"!][!//
[!ENDIF!][!//
[!IF "AdcHwUnitId = 'ADC_UNIT_1'"!][!//
[!VAR "ADC1_EXISTS" = "1"!][!//
[!ENDIF!][!//
[!ENDLOOP!][!//

[!VAR "LoopVar"="0"!][!//
[!IF "num:i($ADC0_EXISTS) = '1'"!][!//
/**
* @brief          Definition of channels on ADC Hardware unit 0.
* @details        Array of conversion command messages.
*
* @implements     DADC04079
*/
STATIC CONST(Adc_LLD_ChannelConfiguration, ADC_CONST) Adc_Channels_CfgPC_0[] =
{
[!FOR "x" = "0" TO "num:i(count(AdcConfigSet/*[1]/AdcHwUnit/*[AdcHwUnitId='ADC_UNIT_0']/AdcChannel/*)-1)"!][!//
[!LOOP "AdcConfigSet/*[1]/AdcHwUnit/*/AdcChannel/*"!][!//
[!VAR "Loop"="num:i($LoopVar)"!][!//
[!IF "../../AdcHwUnitId = 'ADC_UNIT_0'"!][!//
[!IF "AdcChannelId = $Loop"!][!//
  /**< @brief Hardware Unit [!"../../AdcHwUnitId"!]  --  [!"AdcHwChannel"!] */
  {
    /**< @brief Adc physical channel */
      (Adc_ChannelType)(ADC_ID_CHANNEL([!IF "contains(AdcHwChannel,'ANP_')"!][!"num:i(substring-after(AdcHwChannel,'ANP_'))"!][!ELSE!][!IF "contains(AdcHwChannel,'ANS_')"!][!"num:i(substring-after(AdcHwChannel,'ANS_')+32)"!][!ELSE!][!IF "contains(AdcHwChannel,'ANX_')"!][!"num:i(substring-after(AdcHwChannel,'CH_'))"!][!ENDIF!][!ENDIF!][!ENDIF!])), 
    [!IF "AdcThresholdControl/AdcEnableThresholds = 'true'"!][!//
    /**< @brief Threshold register configured */
    [!"AdcThresholdControl/AdcThresholdControlRegister"!],
    /**< @brief Threshold register value */
    (ADC_LOW_TH0_VALUE([!"AdcThresholdControl/AdcLowThreshold"!])|ADC_HIGH_TH0_VALUE([!"AdcThresholdControl/AdcHighThreshold"!])),
    /**< @brief Threshold control register value */
    (ADC_TH_ENABLE|ADC_CH_THRESHOLD_COMP([!IF "contains(AdcHwChannel,'ANP_')"!][!"num:i(substring-after(AdcHwChannel,'ANP_'))"!][!ELSE!][!IF "contains(AdcHwChannel,'ANS_')"!][!"num:i(substring-after(AdcHwChannel,'ANS_')+32)"!][!ELSE!][!IF "contains(AdcHwChannel,'ANX_')"!][!"num:i(substring-after(AdcHwChannel,'ANX_')+64)"!][!ENDIF!][!ENDIF!][!ENDIF!])),
[!ELSE!][!//
    /**< @brief Threshold register configured */
    ADC_THRESHOLD_REG_0,
    /**< @brief Threshold register value */
    ADC_UNUSED_THRESHOLD,
    /**< @brief Threshold control register value */
    ADC_TH_DISABLE,
[!ENDIF!][!//
[!IF "AdcThresholdControl/AdcEnableThresholds = 'true'"!][!//
[!IF "AdcThresholdControl/AdcWdogNotification != 'NULL_PTR'"!][!//
    /**< @brief Channel WDOG Notification function pointer */
    &[!"AdcThresholdControl/AdcWdogNotification"!], 
[!ELSE!][!//
    /**< @brief No WDOG notification */
    NULL_PTR,
[!ENDIF!][!//
[!ELSE!][!//
    /**< @brief No WDOG notification */
    NULL_PTR,
[!ENDIF!][!//
[!IF "AdcEnablePresampling ='true' "!][!//
    /**< @brief presampling enabled */
    (uint8)0x1
[!ELSE!][!//
    /**< @brief presampling disabled */
    (uint8)0x0
[!ENDIF!][!//
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
    ,
[!IF "AdcChannelLimitCheck ='true' "!][!//
    /**< @brief limit check enabled */
    (boolean)TRUE,
    /**< @brief range for limit check */
    (Adc_ChannelRangeSelectType)[!"AdcChannelRangeSelect"!],
    [!IF "../../../../../../AdcGeneral/AdcResultAlignment = 'ADC_ALIGN_LEFT'"!][!//
        (uint32)[!"num:i(bit:shl(AdcChannelHighLimit,(16 - AdcChannelResolution)))"!],
        (uint32)[!"num:i(bit:shl(AdcChannelLowLimit,(16 - AdcChannelResolution)))"!]
    [!ELSE!][!//    
    /**< @brief high limit value */
    (uint32)[!"num:i(AdcChannelHighLimit)"!],
    /**< @brief low limit value */
    (uint32)[!"num:i(AdcChannelLowLimit)"!]
    [!ENDIF!][!//
[!ELSE!][!//
    /**< @brief limit check disabled */
    (boolean)FALSE,
    /**< @brief range for limit check */
    (Adc_ChannelRangeSelectType)ADC_RANGE_ALWAYS,
    /**< @brief high limit value */
    (uint32)0,
    /**< @brief low limit value */
    (uint32)0
[!ENDIF!][!//
#endif /* (ADC_ENABLE_LIMIT_CHECK == STD_ON) */
[!ENDIF!][!//
[!ENDIF!][!//
[!ENDLOOP!][!//
  }[!IF "$x < (count(AdcConfigSet/*[1]/AdcHwUnit/*[AdcHwUnitId='ADC_UNIT_0']/AdcChannel/*)-1)"!],[!ELSE!][!ENDIF!]
[!VAR "LoopVar"="$LoopVar + 1"!][!//
[!ENDFOR!][!//
};
[!ENDIF!][!//

[!VAR "LoopVar"="0"!][!//
[!IF "num:i($ADC1_EXISTS) = '1'"!][!//
/**
* @brief          Definition of channels on ADC Hardware unit 1.
* @details        Array of conversion command messages.
*
* @implements     DADC04080
*/
STATIC CONST(Adc_LLD_ChannelConfiguration, ADC_CONST) Adc_Channels_CfgPC_1[] =
{
[!FOR "x" = "0" TO "num:i(count(AdcConfigSet/*[1]/AdcHwUnit/*[AdcHwUnitId='ADC_UNIT_1']/AdcChannel/*)-1)"!][!//
[!LOOP "AdcConfigSet/*[1]/AdcHwUnit/*/AdcChannel/*"!][!//
[!VAR "Loop"="num:i($LoopVar)"!][!//
[!IF "../../AdcHwUnitId = 'ADC_UNIT_1'"!][!//
[!IF "AdcChannelId = $Loop"!][!//
  /**< @brief Hardware Unit [!"../../AdcHwUnitId"!]  --  [!"AdcHwChannel"!] */
  {
    /**< @brief Adc physical channel */
       (Adc_ChannelType)(ADC_ID_CHANNEL([!IF "contains(AdcHwChannel,'ANP_')"!][!"num:i(substring-after(AdcHwChannel,'ANP_'))"!][!ELSE!][!IF "contains(AdcHwChannel,'ANS_')"!][!"num:i(substring-after(AdcHwChannel,'ANS_')+32)"!][!ELSE!][!IF "contains(AdcHwChannel,'ANX_')"!][!"num:i(substring-after(AdcHwChannel,'CH_'))"!][!ENDIF!][!ENDIF!][!ENDIF!])),
       [!IF "AdcThresholdControl/AdcEnableThresholds = 'true'"!][!//
    /**< @brief Threshold register configured */
    [!"AdcThresholdControl/AdcThresholdControlRegister"!],
    /**< @brief Threshold register value */
    (ADC_LOW_TH0_VALUE([!"AdcThresholdControl/AdcLowThreshold"!])|ADC_HIGH_TH0_VALUE([!"AdcThresholdControl/AdcHighThreshold"!])),
    /**< @brief Threshold control register value */
    (ADC_TH_ENABLE|ADC_CH_THRESHOLD_COMP([!IF "contains(AdcHwChannel,'ANP_')"!][!"num:i(substring-after(AdcHwChannel,'ANP_'))"!][!ELSE!][!IF "contains(AdcHwChannel,'ANS_')"!][!"num:i(substring-after(AdcHwChannel,'ANS_')+32)"!][!ELSE!][!IF "contains(AdcHwChannel,'ANX_')"!][!"num:i(substring-after(AdcHwChannel,'ANX_')+64)"!][!ENDIF!][!ENDIF!][!ENDIF!])),
[!ELSE!][!//
    /**< @brief Threshold register configured */
    ADC_THRESHOLD_REG_0,
    /**< @brief Threshold register value */
    ADC_UNUSED_THRESHOLD,
    /**< @brief Threshold control register value */
    ADC_TH_DISABLE,
[!ENDIF!][!//
[!IF "AdcThresholdControl/AdcEnableThresholds = 'true'"!][!//
[!IF "AdcThresholdControl/AdcWdogNotification != 'NULL_PTR'"!][!//
    /**< @brief Channel WDOG Notification function pointer */
    &[!"AdcThresholdControl/AdcWdogNotification"!],
[!ELSE!][!//
    /**< @brief No WDOG notification */
    NULL_PTR,
[!ENDIF!][!//
[!ELSE!][!//
    /**< @brief No WDOG notification */
    NULL_PTR,
[!ENDIF!][!//
[!IF "AdcEnablePresampling ='true' "!][!//
    /**< @brief presampling enabled */
    (uint8)0x1
[!ELSE!][!//
    /**< @brief presampling disabled */
    (uint8)0x0
[!ENDIF!][!//
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
    ,
[!IF "AdcChannelLimitCheck ='true' "!][!//
    /**< @brief limit check enabled */
    (boolean)TRUE,
    /**< @brief range for limit check */
    (Adc_ChannelRangeSelectType)[!"AdcChannelRangeSelect"!],
    [!IF "../../../../../../AdcGeneral/AdcResultAlignment = 'ADC_ALIGN_LEFT'"!][!//
        (uint32)[!"num:i(bit:shl(AdcChannelHighLimit,(16 - AdcChannelResolution)))"!],
        (uint32)[!"num:i(bit:shl(AdcChannelLowLimit,(16 - AdcChannelResolution)))"!]
    [!ELSE!][!//    
    /**< @brief high limit value */
    (uint32)[!"num:i(AdcChannelHighLimit)"!],
    /**< @brief low limit value */
    (uint32)[!"num:i(AdcChannelLowLimit)"!]
   [!ENDIF!][!//
[!ELSE!][!//
    /**< @brief limit check disabled */
    (boolean)FALSE,
    /**< @brief range for limit check */
    (Adc_ChannelRangeSelectType)ADC_RANGE_ALWAYS,
    /**< @brief high limit value */
    (uint32)0,
    /**< @brief low limit value */
    (uint32)0
[!ENDIF!][!//
#endif /* (ADC_ENABLE_LIMIT_CHECK == STD_ON) */
[!ENDIF!][!//
[!ENDIF!][!//
[!ENDLOOP!][!//
  }[!IF "$x < (count(AdcConfigSet/*[1]/AdcHwUnit/*[AdcHwUnitId='ADC_UNIT_1']/AdcChannel/*)-1)"!],[!ELSE!][!ENDIF!]
[!VAR "LoopVar"="$LoopVar + 1"!][!//
[!ENDFOR!][!//
};
[!ENDIF!][!//

/**
* @brief          Definition of channels's pointer structure.
*
* @implements     DADC04081
*/
STATIC P2CONST(Adc_LLD_ChannelConfiguration, ADC_VAR, ADC_APPL_CONST) Adc_Channels_CfgPC[] =
{
[!IF "AdcConfigSet/*[1]/AdcHwUnit/*/AdcHwUnitId = 'ADC_UNIT_0'"!][!//
  Adc_Channels_CfgPC_0,
[!ELSE!][!//
  NULL_PTR,
[!ENDIF!][!//
[!IF "AdcConfigSet/*[1]/AdcHwUnit/*/AdcHwUnitId = 'ADC_UNIT_1'"!][!//
  Adc_Channels_CfgPC_1
[!ELSE!][!//
  NULL_PTR
[!ENDIF!][!//
};

[!VAR "LoopVar"="0"!][!//
[!VAR "AdcGrpLatchDuration" = "0"!][!//
[!VAR "AdcGrpComparisionDuration" = "0"!][!//
[!VAR "AdcGrpSamplingDuration" = "0"!][!//
[!VAR "EnableCHDisableCHIndex" ="0"!][!//
/**
* @brief          Definition of all ADC groups.
*
* @implements     DADC04083
*/
STATIC CONST(Adc_LLD_GroupConfiguration, ADC_CONST) Adc_Groups_CfgPC[ADC_GROUPS] =
{
[!FOR "x" = "0" TO "num:i(count(AdcConfigSet/*[1]/AdcHwUnit/*/AdcGroup/*)-1)"!][!//
[!LOOP "AdcConfigSet/*[1]/AdcHwUnit/*/AdcGroup/*"!][!//
[!VAR "Loop"="num:i($LoopVar)"!][!//
[!VAR "NUM_TRIGGER" = "count(AdcHwTrig/*)"!][!//
[!IF "AdcGroupId = $Loop"!][!//
[!NOCODE!]
[!VAR "AdcExternalChExist" = "0"!]
[!VAR "AdcTemp_Ch" = "0"!]
[!VAR "AdcPrecise_Ch" = "0"!]
[!VAR "AdcExtd_Ch" = "0"!]
[!VAR "AdcExternal_Ch" = "0"!]
[!VAR "AdcPrecise_Psr" = "0"!]
[!VAR "AdcExtd_Psr" = "0"!]
[!VAR "AdcExternal_Psr" = "0"!]
[!VAR "AdcWer0" = "0"!]
[!VAR "AdcWer1" = "0"!]
[!VAR "AdcWer2" = "0"!]
[!VAR "FirstDmaCh" = "0"!]
[!VAR "LastDmaCh" = "0"!]
[!VAR "PreFlag" = "0"!]
[!VAR "ExtdFlag" = "0"!]
[!VAR "ExtrFlag" = "0"!]

[!LOOP "AdcGroupDefinition/*"!]
    [!VAR "CurrAdcChannel" = "."!]
    [!VAR "CurrAdcChannel1" = "substring-after(substring-after(substring-after(substring-after(substring-after($CurrAdcChannel,'/'),'/'),'/'),'/'),'/')"!]
[!LOOP "../../../../AdcChannel/*"!]
[!IF "$CurrAdcChannel1 = @name"!]
[!IF "contains(AdcHwChannel,'ANP_')"!]
[!VAR "AdcTemp_Ch" = "substring-after(AdcHwChannel,'ANP_')"!]

