DriveMani/DriverInput-MCU/ts_mirr/xml/eb-tresos-MPC560XB_MCAL4_0_RTM_1_0_1_HF13/plugins/Adc_TS_T2D13M10I1R0/generate_PC/src/Adc_Cfg.c
[!IF "$PreFlag = 0"!]
[!VAR "FirstDmaCh" = "$AdcTemp_Ch"!]
[!VAR "PreFlag" ="2"!]
[!VAR "ExtdFlag" ="1"!]
[!VAR "ExtrFlag" = "1"!]
[!ENDIF!]

[!VAR "AdcTemp_Ch" = "bit:shl(1,$AdcTemp_Ch)"!]
[!VAR "AdcPrecise_Ch" = "bit:or($AdcPrecise_Ch,$AdcTemp_Ch)"!]
[!IF "AdcEnablePresampling"!]
[!VAR "AdcPrecise_Psr" = "bit:or($AdcPrecise_Psr,$AdcTemp_Ch)"!]
[!ENDIF!]

    [!SELECT "AdcThresholdControl"!]
    [!IF "AdcEnableThresholds"!]
        [!VAR "AdcWer0" = "bit:or($AdcWer0,$AdcTemp_Ch)"!]
    [!ENDIF!]
    [!ENDSELECT!]

[!ELSE!][!IF "contains(AdcHwChannel,'ANS_')"!]
[!VAR "AdcTemp_Ch" = "substring-after(AdcHwChannel,'ANS_')"!]

[!IF "$ExtdFlag = 0"!]
[!VAR "FirstDmaCh" = "$AdcTemp_Ch + 32"!]
[!VAR "PreFlag" ="1"!]
[!VAR "ExtdFlag" ="2"!]
[!VAR "ExtrFlag" = "1"!]
[!ENDIF!]

[!VAR "AdcTemp_Ch" = "bit:shl(1,$AdcTemp_Ch)"!]
[!VAR "AdcExtd_Ch" = "bit:or($AdcExtd_Ch,$AdcTemp_Ch)"!]
[!IF "AdcEnablePresampling"!]
[!VAR "AdcExtd_Psr" = "bit:or($AdcExtd_Psr,$AdcTemp_Ch)"!]
[!ENDIF!]

    [!SELECT "AdcThresholdControl"!]
    [!IF "AdcEnableThresholds"!]
        [!VAR "AdcWer1" = "bit:or($AdcWer1,$AdcTemp_Ch)"!]
    [!ENDIF!]
    [!ENDSELECT!]

[!ELSE!][!IF "contains(AdcHwChannel,'ANX_')"!]
[!VAR "AdcExternalChExist" ="1"!]
[!VAR "AdcTemp_Ch" = "num:i(substring-after(AdcHwChannel,'CH_') - 64)"!]

[!IF "$ExtrFlag = 0"!]
[!VAR "FirstDmaCh" = "$AdcTemp_Ch + 64"!]
[!VAR "PreFlag" ="1"!]
[!VAR "ExtdFlag" ="1"!]
[!VAR "ExtrFlag" = "2"!]
[!ENDIF!]

[!VAR "AdcTemp_Ch" = "bit:shl(1,$AdcTemp_Ch)"!]
[!VAR "AdcExternal_Ch" = "bit:or($AdcExternal_Ch,$AdcTemp_Ch)"!]
[!IF "AdcEnablePresampling"!]
[!VAR "AdcExternal_Psr" = "bit:or($AdcExternal_Psr,$AdcTemp_Ch)"!]
[!ENDIF!]

    [!SELECT "AdcThresholdControl"!]
    [!IF "AdcEnableThresholds"!]
        [!VAR "AdcWer2" = "bit:or($AdcWer2,$AdcTemp_Ch)"!]
    [!ENDIF!]
    [!ENDSELECT!]

[!ENDIF!]
[!ENDIF!]
[!ENDIF!]

[!ENDIF!]
[!ENDLOOP!]
[!ENDLOOP!]

[!IF "$PreFlag = 2"!]
        [!VAR "Position" = "32768"!][!//Position =0x8000U(32768), 16 precision channel max
        [!FOR "Loop" = "0" TO "15"!]
        [!VAR "Value" = "bit:shr($Position,$Loop)"!]
        [!VAR "Ret_Value" = "bit:and($AdcPrecise_Ch,$Value)"!]
        [!IF "$Ret_Value>0"!][!VAR "LastDmaCh" = "15-$Loop"!][!BREAK!][!ENDIF!]
        [!ENDFOR!]
[!ELSE!][!IF "$ExtdFlag = 2"!]
        [!VAR "Position" = "134217728"!][!//Position =0x8000000U(134217728), 28 medium accuracy channel max.
        [!FOR "Loop" = "0" TO "27"!]
        [!VAR "Value" = "bit:shr($Position,$Loop)"!]
        [!VAR "Ret_Value" = "bit:and($AdcExtd_Ch,$Value)"!]
        [!IF "$Ret_Value>0"!][!VAR "LastDmaCh" = "59-$Loop"!][!BREAK!][!ENDIF!]
        [!ENDFOR!]
[!ELSE!][!IF "$ExtrFlag = 2"!]
        [!VAR "Position" = "2147483648"!][!//Position =0x80000000U(2147483648), 32 external channel max.
        [!FOR "Loop" = "0" TO "31"!]
        [!VAR "Value" = "bit:shr($Position,$Loop)"!]
        [!VAR "Ret_Value" = "bit:and($AdcExternal_Ch,$Value)"!]
        [!IF "$Ret_Value>0"!][!VAR "LastDmaCh" = "95-$Loop"!][!BREAK!][!ENDIF!]
        [!ENDFOR!]
[!ENDIF!]
[!ENDIF!]
[!ENDIF!]
[!ENDNOCODE!]
[!NOCODE!]
[!IF "(../../AdcHwUnitId = '0') and (../../../../../../AdcGeneral/AdcMuxDelaySupport = 'true') and ($AdcExternalChExist = 1) and
      ((AdcGroupTriggSrc = 'ADC_TRIGG_SRC_HW') or ((AdcGroupTriggSrc = 'ADC_TRIGG_SRC_SW') and (AdcGroupConversionType = 'ADC_CONV_TYPE_INJECTED'))) and
      (num:i(../../AdcMuxDelay) > 0)"!]
[!ERROR!]
     Group configured as HW TRIGGER GROUP or SW INJECTED GROUP with at least one ANX channel and AdcMuxDelay value
     greater than 0 is not supported. Please check the configuration for the Group with ID [!"AdcGroupId"!] for the ADC HW Unit with ID [!"../../AdcHwUnitId"!].
[!ENDERROR!]
[!ENDIF!]
[!ENDNOCODE!]
  /**< @brief Group[!"AdcGroupId"!] -- Hardware Unit [!"../../AdcHwUnitId"!] */
  {
    /**< @brief Hardware unit configured */
    (Adc_HwUnitType)[!"../../AdcHwUnitId"!],
    /**< @brief Access mode */
    [!"AdcGroupAccessMode"!],
    /**< @brief Conversion mode */
    [!"AdcGroupConversionMode"!],
    /**< @brief Conversion type */
    [!"AdcGroupConversionType"!],
    #if (ADC_PRIORITY_IMPLEMENTATION != ADC_PRIORITY_NONE)
    /**< @brief  Priority configured */
    [!IF "../../../../../AdcGeneral/AdcPriorityImplementation != 'ADC_PRIORITY_NONE'"!]ADC_GROUP_PRIORITY([!"AdcGroupPriority"!]),[!ELSE!]ADC_GROUP_PRIORITY(0U),[!ENDIF!]
    #endif
    /**< @brief Replacement mode */
    ADC_GROUP_REPL_ABORT_RESTART,
    /**< @brief Trigger source configured */
    [!"AdcGroupTriggSrc"!],
    #if (STD_ON==ADC_HW_TRIGGER_API)
    #if (STD_ON == ADC_MULTIPLE_HARDWARE_TRIGGERS)
    [!IF "AdcMultipleHardwareTriggerGroup"!][!//
    /**< @brief This is an MHT group */
    (Adc_MhtGroupType)ADC_MHT_GROUP_TYPE,
    [!ELSE!][!//
    /**< @brief This a Regular Group */
    (Adc_MhtGroupType)ADC_REGULAR_GROUP_TYPE,
    [!ENDIF!][!//
    #endif /* (STD_ON == ADC_MULTIPLE_HARDWARE_TRIGGERS) */
    /**< @brief Hardware trigger signal */
    [!IF "(../../../../../../AdcGeneral/AdcHwTriggerApi = 'true') and (AdcGroupTriggSrc = 'ADC_TRIGG_SRC_HW')"!][!"AdcHwTrigSignal"!],[!ELSE!]ADC_HW_TRIG_BOTH_EDGES,[!ENDIF!]
    /**< @brief Number of hardware trigger sources */
    [!IF "(../../../../../../AdcGeneral/AdcHwTriggerApi = 'true') and (AdcGroupTriggSrc = 'ADC_TRIGG_SRC_HW')"!](Adc_HwTriggerTimerType)[!"num:i($NUM_TRIGGER)"!][!ELSE!][!"num:i(0)"!]U[!ENDIF!],
    /**< @brief Hardware resource for the group */
    [!IF "(../../../../../../AdcGeneral/AdcHwTriggerApi = 'true') and (AdcGroupTriggSrc = 'ADC_TRIGG_SRC_HW')"!]Adc_GroupTriggerSource[!"AdcGroupId"!]_PC[!ELSE!][!"num:i(0)"!]U[!ENDIF!],
    #endif /* (STD_ON==ADC_HW_TRIGGER_API) */
    #if (STD_ON==ADC_GRP_NOTIF_CAPABILITY)
    /**< @brief Notification function */
    [!IF "../../../../../../AdcGeneral/AdcGrpNotifCapability = 'true'"!][!//
    [!IF "AdcNotification != 'NULL_PTR'"!]&[!"AdcNotification"!],[!ELSE!][!"AdcNotification"!],[!ENDIF!]
    [!ELSE!]NULL_PTR,
    [!ENDIF!][!//
    #endif /* (STD_ON==ADC_GRP_NOTIF_CAPABILITY) */
    /**< @brief Precision configured channels */
    (uint32)[!"num:inttohex($AdcPrecise_Ch)"!],
    /**< @brief Extended configured channels */
    (uint32)[!"num:inttohex($AdcExtd_Ch)"!],
    /**< @brief External configured channels */
    (uint32)[!"num:inttohex($AdcExternal_Ch)"!],
  
