DriveMani/DriverInput-MCU/ts_mirr/xml/eb-tresos-MPC560XB_MCAL4_0_RTM_1_0_1_HF13/plugins/Adc_TS_T2D13M10I1R0/generate_PC/src/Adc_Cfg.c
[!IF "(../../../../../../AdcGeneral/AdcPreSamplingOnce)='false'"!][!//
    /**< @brief Presampling for Precision channels */
    (uint32)[!"num:inttohex($AdcPrecise_Psr)"!]U,
    /**< @brief Presampling for Extended channels */
    (uint32)[!"num:inttohex($AdcExtd_Psr)"!]U,
    /**< @brief Presampling for External channels */
    (uint32)[!"num:inttohex($AdcExternal_Psr)"!]U,
[!ENDIF!][!//
[!IF "(../../../../../../AdcGeneral/AdcWdgThresholdOnce)='false'"!][!//
    /**< @brief Wer0 for precision channels */
    (uint32)[!"num:inttohex($AdcWer0)"!]U,
    /**< @brief Wer1 for extended(medi.accuracy channels) */
    (uint32)[!"num:inttohex($AdcWer1)"!]U,
    /**< @brief Wer2 for external channels */
    (uint32)[!"num:inttohex($AdcWer2)"!]U,
    [!ENDIF!][!//
[!IF "(../../../../../../AdcGeneral/AdcMuxDelaySupport = 'true') and (../../../../../../AdcGeneral/AdcMuxDelaySupportPerGroup = 'true')"!][!//
[!IF "($AdcExternalChExist = 1) and (AdcGroupTriggSrc = 'ADC_TRIGG_SRC_SW') and (AdcGroupConversionType = 'ADC_CONV_TYPE_NORMAL') and (../../AdcHwUnitId = 'ADC_UNIT_0')"!][!//
    (uint8)[!IF "AdcMuxDelayNeeded"!]STD_ON[!ELSE!]STD_OFF[!ENDIF!], /* Enables or Disables Adc Mux Delay */
[!ELSE!][!//
    (uint8)STD_OFF, /* Enables or Disables Adc Mux Delay */
[!ENDIF!][!//
[!ENDIF!][!//
    /**< @brief ADC Group Result Buffers RAM array */
    ADC_ResultsBufferPtr,
    /**< @brief Group Streaming Buffer Mode */
    [!"AdcStreamingBufferMode"!],
    #if (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON)
    /**< @brief Index of the group with AdcEnableChDisableChGroup enabled */
    (Adc_GroupType)[!IF "AdcEnableChDisableChGroup = 'true'"!][!"num:i($EnableCHDisableCHIndex)"!][!VAR "EnableCHDisableCHIndex" = "$EnableCHDisableCHIndex + 1"!][!ELSE!]ADC_ENABLE_CH_DISABLE_CH_INVALID_GROUP_INDEX[!ENDIF!],
    #endif /* (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON) */
    /**< @brief Number of streaming samples */
    ADC_STREAMING_NUM_SAMPLES([!"AdcStreamingNumSamples"!]),
    /**< @brief Channels assigned to the group */
    [!IF "../../AdcHwUnitId = 'ADC_UNIT_0' "!]ADC_Group[!"AdcGroupId"!]_Assignment_PC_0,[!ELSE!]ADC_Group[!"AdcGroupId"!]_Assignment_PC_1,[!ENDIF!]
    /**< @brief Number of channels in the group */
    (Adc_ChannelType)ADC_CFGSET1_GROUP_[!"AdcGroupId"!]_CHANNELS,
[!IF "(../../../../../../AdcGeneral/AdcConvTimeOnce)='false'"!][!//
[!NOCODE!][!//
    [!VAR "AdcGrpLatchDuration" = "AdcGroupConversionConfiguration/AdcLatchingDuration"!][!//
    [!VAR "AdcGrpComparisionDuration" = "AdcGroupConversionConfiguration/AdcComparisonDuration"!][!//
    [!VAR "AdcGrpSamplingDuration" = "AdcGroupConversionConfiguration/AdcSamplingDuration"!][!//
[!ENDNOCODE!][!//
    /**< @brief Conversion time */
    (ADC_INPLATCH_VALUE([!"$AdcGrpLatchDuration"!])|ADC_INPCMP_VALUE([!"$AdcGrpComparisionDuration"!])|ADC_INPSAMP_VALUE([!"$AdcGrpSamplingDuration"!])),
[!ENDIF!][!//
    /**< @brief Last Channel configured */
    (uint32)([!"num:i($LastDmaCh)"!]),
    /**< @brief First Channel Configured */
    (ADC_ID_CHANNEL([!"num:i($FirstDmaCh)"!])<<(uint32)2),
    /**< @brief Enables or Disables the ADC and DMA interrupts */
    (uint8)[!IF "AdcWithoutInterrupts"!]STD_ON[!ELSE!]STD_OFF[!ENDIF!]
[!ENDIF!][!//
[!ENDLOOP!][!//
  }[!IF "$x < (count(AdcConfigSet/*[1]/AdcHwUnit/*/AdcGroup/*)-1)"!],[!ELSE!][!ENDIF!]
[!VAR "LoopVar"="$LoopVar + 1"!][!//
[!ENDFOR!][!//
};
[!VAR "LoopVar"="0"!][!//

/* @violates @ref Adc_Cfg_c_REF_3 Identifier exceeds 31 characters */
#define ADC_STOP_SEC_CONFIG_DATA_UNSPECIFIED
/* @violates @ref Adc_Cfg_c_REF_1 only preprocessor statements and comments before "#include" */
/* @violates @ref Adc_Cfg_c_REF_2 Repeated include file */
#include "MemMap.h"
/*==================================================================================================
*                                      GLOBAL CONSTANTS
==================================================================================================*/
/* @violates @ref Adc_Cfg_c_REF_3 Identifier exceeds 31 characters */
#define ADC_START_SEC_CONFIG_DATA_UNSPECIFIED
/* @violates @ref Adc_Cfg_c_REF_1 only preprocessor statements and comments before "#include" */
/* @violates @ref Adc_Cfg_c_REF_2 Repeated include file */
#include "MemMap.h"

[!NOCODE!]
[!VAR "AdcDemErrorEnable" = "'false'"!]
[!IF "NonAutosar/AdcDisableDemReportErrorStatus ='false'"!][!//
    [!IF "node:exists(AdcDemEventParameterRefs)"!]
        [!VAR "AdcDemErrorEnable" = "'true'"!]
    [!ENDIF!]
[!ENDIF!]
[!ENDNOCODE!][!//

#if (ADC_DISABLE_DEM_REPORT_ERROR_STATUS == STD_ON)
/**
* @brief         Values for production code Event Ids.
* @details       ADC production code Event Ids.
*
* @implements     DADC06021
*/
CONST(Mcal_DemErrorType,ADC_CONST)Adc_E_TimeoutCfg = [!//
[!IF "$AdcDemErrorEnable"!][!//
[!IF "node:exists(AdcDemEventParameterRefs/ADC_E_TIMEOUT)"!][!//
[!IF "node:exists(node:ref(AdcDemEventParameterRefs/ADC_E_TIMEOUT))"!][!//
{ (uint32)STD_ON, (uint32)[!"node:value(node:ref(AdcDemEventParameterRefs/ADC_E_TIMEOUT)/DemEventId)"!]U}; /* ADC_E_TIMEOUT parameters*/
[!ELSE!][!//
    [!ERROR "Invalid reference for ADC_E_ERROR"!][!//
[!ENDIF!][!//
[!ELSE!][!//
{(uint32)STD_OFF, (uint32)0U}; /* ADC_E_TIMEOUT parameters*/
[!ENDIF!][!//
[!ELSE!][!//
{(uint32)STD_OFF, (uint32)0U};/* ADC_E_TIMEOUT parameters*/
[!ENDIF!][!// 
#endif /* ADC_DISABLE_DEM_REPORT_ERROR_STATUS == STD_ON */

/**
* @brief          ADC driver Configuration structure.
*
* @implements    DADC04084
*/
CONST(Adc_ConfigType, ADC_CONST) Adc_ConfigPC =
{
    /**< @brief pointer to Hw unit configurations */
    Adc_HWUnit_CfgPC,
    /**< @brief pointer to group configurations */
    Adc_Groups_CfgPC,
    /**< @brief pointer to channel configurations */
    Adc_Channels_CfgPC,
    /**< @brief total number of groups */
    (Adc_GroupType)ADC_GROUPS,

    /**< @brief Miscellaneous configuration parameters. - Adc_LLD_MultiConfig */
    {
  [!IF "AdcConfigSet/*[1]/AdcGeneric/AdcTransferType = 'ADC_DMA'"!][!//
    /**< @brief DMA driven mode.  */
    [!"AdcConfigSet/*[1]/AdcGeneric/AdcTransferType"!],
  [!ELSE!][!//
    /**< @brief Interrupt driven Mode */
    ADC_INTERRUPT,
  [!ENDIF!]
    /**< @brief ADC is CTUV2 driven or not */
    (uint8)STD_OFF,
    /**< @brief number of the maximum groups in the current configuration */
    [!"num:i(count(AdcConfigSet/*[1]/AdcHwUnit/*/AdcGroup/*))"!]U,
    /**< @brief number of the maximum hardware units in the current configuration */
    [!"num:i(count(AdcConfigSet/*[1]/AdcHwUnit/*))"!]U,
    /**< @brief depth of the queue */
    [!"AdcConfigSet/*[1]/AdcGeneric/AdcPriorityQueueMaxDepth"!]U,
    [!VAR "groups_hw_unit0" = "0"!][!//
    [!VAR "groups_hw_unit1" = "0"!][!//
    [!LOOP "AdcConfigSet/*[1]/AdcHwUnit/*/AdcGroup/*"!][!//
    [!IF "../../AdcHwUnitId = 'ADC_UNIT_0'"!][!//
    [!VAR "groups_hw_unit0" = "$groups_hw_unit0 + 1"!][!//
    [!ENDIF!][!//
    [!IF "../../AdcHwUnitId = 'ADC_UNIT_1'"!][!//
    [!VAR "groups_hw_unit1" = "$groups_hw_unit1 + 1"!][!//
    [!ENDIF!][!//
    [!ENDLOOP!]
    {
      /**< @brief number of groups of the hw unit 0 */
      (uint8)[!"num:i($groups_hw_unit0)"!][!//
[!IF "$BOLERO256K=0"!],
      /**< @brief number of groups of the hw unit 1 */
      (uint8)[!"num:i($groups_hw_unit1)"!]
[!ENDIF!][!//      
    },
 [!NOCODE!][!//
  [!VAR "channels_hw_unit0" = "0"!][!//
  [!VAR "channels_hw_unit1" = "0"!][!//
  [!LOOP "AdcConfigSet/*[1]/AdcHwUnit/*/AdcChannel/*"!][!//
    [!IF "../../AdcHwUnitId = 'ADC_UNIT_0'"!][!//
      [!VAR "channels_hw_unit0" = "$channels_hw_unit0 + 1"!][!//
    [!ENDIF!][!//
    [!IF "../../AdcHwUnitId = 'ADC_UNIT_1'"!][!//
      [!VAR "channels_hw_unit1" = "$channels_hw_unit1 + 1"!][!//
    [!ENDIF!][!//
  [!ENDLOOP!]
 [!ENDNOCODE!][!//
    {
      /**< @brief number of channels of the hw unit 0 */
      (uint8)[!"num:i($channels_hw_unit0)"!][!//
[!IF "$BOLERO256K=0"!],
      (uint8)[!"num:i($channels_hw_unit1)"!]  /* number of channels of the hw unit 1 */
[!ENDIF!][!//
    },
    {[!//
      [!IF "AdcConfigSet/*[1]/AdcGeneric/AdcTransferType = 'ADC_DMA'"!][!//
      [!NOCODE!][!//
        [!FOR "x" = "0" TO "num:i(count(AdcConfigSet/*[1]/AdcHwUnit/*))"!][!//
        [!LOOP "AdcConfigSet/*[1]/AdcHwUnit/*"!][!//
        [!VAR "Loop"="num:i($LoopVar)"!][!//
        [!IF "num:i(number(substring-after(AdcHwUnitId,'ADC_UNIT_'))) = $Loop"!][!//
          [!VAR "temp_name"="concat('ADC',num:i(number(substring-after(AdcHwUnitId,'ADC_UNIT_'))),'_EOC')"!][!// /**< @brief if concat is used directly in the following expresion the match will fail */
          [!IF "$temp_name = 'ADC0_EOC' and (node:refs('ASPathDataOfSchema:/AUTOSAR/Mcu')/McuModuleConfiguration/*/McuDMA/*/DMAChannelEnable[.='true'])"!][!//
            [!IF "$BOLERO256K=1"!][!//
              [!VAR "temp_name"="concat('ADC','1','_EOC')"!][!// in Mcu plugin related to McuDMA for hw 0 in Bolero 256K the name of the container is ADC1_EOC
            [!ENDIF!][!//
      [!CODE!][!//
      /**< @brief the DMA channel number for ADC Hardware unit 0 */
      (uint8)[!"node:refs('ASPathDataOfSchema:/AUTOSAR/Mcu')/McuModuleConfiguration/*/McuDMA/*/DMAChannelEnable[.='true']/../McuDMASource[.=$temp_name]/../DMAChannelId"!],
      [!ENDCODE!][!//
            [!VAR "temp_name"="concat('ADC',AdcHwUnitId,'_EOC')"!][!// if concat is used directly in the following expresion the match will fail
          [!ELSEIF "$ADC0_EXISTS = 0"!][!//
      [!CODE!][!//
      /**< @brief the DMA channel number for ADC Hardware unit 0 */
      (uint8)0,
      [!ENDCODE!][!//
          [!ENDIF!]
          [!IF "$temp_name = 'ADC1_EOC' and (node:refs('ASPathDataOfSchema:/AUTOSAR/Mcu')/McuModuleConfiguration/*/McuDMA/*/DMAChannelEnable[.='true'])"!][!//
      [!CODE!][!//
      /**< @brief the DMA channel number for ADC Hardware unit 1 */
      (uint8)[!"node:refs('ASPathDataOfSchema:/AUTOSAR/Mcu')/McuModuleConfiguration/*/McuDMA/*/DMAChannelEnable[.='true']/../McuDMASource[.=$temp_name]/../DMAChannelId"!]
      [!ENDCODE!][!//
          [!ELSEIF "$ADC1_EXISTS = 0"!][!//
            [!IF "$BOLERO256K=0"!][!//
      [!CODE!][!//
      /**< @brief the DMA channel number for ADC Hardware unit 1 */
      (uint8)0
      [!ENDCODE!][!//
            [!ENDIF!][!//
          [!ENDIF!][!//
        [!ENDIF!][!//
        [!ENDLOOP!][!//
        [!VAR "LoopVar"="$LoopVar + 1"!][!//
        [!ENDFOR!][!//
      [!ENDNOCODE!][!//
      [!ELSE!][!//
      /**< @brief the DMA channel number for both ADC Hardware units */
      (uint8)0,
      [!IF "$BOLERO256K=0"!][!//
      (uint8)0
      [!ENDIF!][!//
      [!ENDIF!][!//
    },
    {
      /**< @brief ADC_UNIT_0 - ON/OFF */
      [!IF "AdcConfigSet/*[1]/AdcHwUnit/*/AdcHwUnitId = 'ADC_UNIT_0'"!](uint8)STD_ON[!ELSE!](uint8)STD_OFF[!ENDIF!],
        [!IF "$BOLERO256K=0"!][!//
      /**< @brief ADC_UNIT_1 - ON/OFF */
      [!IF "AdcConfigSet/*[1]/AdcHwUnit/*/AdcHwUnitId = 'ADC_UNIT_1'"!](uint8)STD_ON[!ELSE!](uint8)STD_OFF[!ENDIF!]
        [!ENDIF!][!//
    },
    {
     [!NOCODE!][!//
      [!VAR "mhtGroups_hw_0" = "0"!][!//
      [!VAR "mhtGroups_hw_1" = "0"!][!//
      [!LOOP "AdcConfigSet/*[1]/AdcHwUnit/*/AdcGroup/*"!][!//
        [!IF "../../AdcHwUnitId = 'ADC_UNIT_0'"!][!//
          [!IF "AdcMultipleHardwareTriggerGroup = 'true'"!][!//
            [!VAR "mhtGroups_hw_0" = "$mhtGroups_hw_0 + 1"!][!//
          [!ENDIF!][!//
        [!ENDIF!][!//
        [!IF "../../AdcHwUnitId = 'ADC_UNIT_1'"!][!//
          [!IF "AdcMultipleHardwareTriggerGroup = 'true'"!][!//
            [!VAR "mhtGroups_hw_1" = "$mhtGroups_hw_1 + 1"!][!//
          [!ENDIF!][!//
        [!ENDIF!][!//
      [!ENDLOOP!][!//
      [!ENDNOCODE!][!//
      /**< @brief number of MHT groups of the ADC Hardware unit 0 */
      (uint8)[!"num:i($mhtGroups_hw_0)"!],
      [!IF "$BOLERO256K=0"!][!//
      /**< @brief number of MHT groups of the ADC Hardware unit 1 */
      (uint8)[!"num:i($mhtGroups_hw_1)"!]  /* number of MHT groups of the hw unit 1 */
      [!ENDIF!][!//
    }
    }
};

/* @violates @ref Adc_Cfg_c_REF_3 Identifier exceeds 31 characters */
#define ADC_STOP_SEC_CONFIG_DATA_UNSPECIFIED
/* @violates @ref Adc_Cfg_c_REF_1 only preprocessor statements and comments before "#include" */
/* @violates @ref Adc_Cfg_c_REF_2 Repeated include file */
#include "MemMap.h"

/*==================================================================================================
*                                   LOCAL FUNCTION PROTOTYPES
==================================================================================================*/

/*==================================================================================================
*                                       LOCAL FUNCTIONS
==================================================================================================*/

/*==================================================================================================
*                                       GLOBAL FUNCTIONS
==================================================================================================*/

#endif  /* ADC_PRECOMPILE_SUPPORT */

#ifdef __cplusplus
}
#endif

/** @} */

[!ENDCODE!][!//
